Version2/TestTool/TestTool.Setup/Requests/RecordingControl/SetTrackConfiguration/SetTrackConfiguration (Audio).xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trc:SetTrackConfiguration>
      <trc:RecordingToken>tokenRecording1</trc:RecordingToken>
      <trc:TrackToken>tokenTrack1</trc:TrackToken>
      <trc:TrackConfiguration>
        <trc:TrackType>Audio</trc:TrackType>
        <trc:Description>Any description</trc:Description>
      </trc:TrackConfiguration>
    </trc:SetTrackConfiguration>
  </soap:Body>
</soap:Envelope>